nothing
special
charge
diamond
member
hilton
decided
chain
shot
20th
anniversary
seattle
start
booked
suite
paid
extra
website
description
suite
bedroom
bathroom
standard
hotel
room
took
printed
reservation
desk
showed
said
things
like
couch
desk
clerk
told
mixed
suites
description
kimpton
website
sorry
free
breakfast
kidding
embassy
suits
sitting
room
bathroom
bedroom
unlike
kimpton
calls
suite
stay
offer
correct
false
advertising
send
kimpton
preferred
guest
website
email
asking
failure
provide
suite
advertised
website
reservation
description
furnished
hard
copy
reservation
printout
website
desk
manager
duty
reply
solution
send
email
trip
guest
survey
follow
email
mail
guess
tell
concerned
guest
staff
ranged
indifferent
helpful
asked
desk
good
breakfast
spots
neighborhood
hood
told
hotels
best
breakfast
spots
seattle
block
away
convenient
hotel
does
know
exist
arrived
late
night
inside
bellman
busy
chating
cell
phone
help
bags
prior
arrival
emailed
hotel
inform
20th
anniversary
half
really
picky
wanted
make
sure
good
nice
email
saying
like
deliver
bottle
champagne
chocolate
covered
strawberries
room
arrival
celebrate
told
needed
foam
pillows
arrival
champagne
strawberries
foam
pillows
great
room
view
alley
high
rise
building
good
better
housekeeping
staff
cleaner
room
property
impressed
left
morning
shopping
room
short
trips
hours
beds
comfortable
good
ac-heat
control
inch
screen
bring
green
shine
directly
eyes
night
light
sensitive
tape
controls
this
start
hotel
clean
business
hotel
super
high
rates
better
chain
hotels
seattle
poor
value
stayed
monaco
seattle
july
nice
hotel
priced
100-
night
hotel
takes
beating
quotient
experience
simply
average
nothing
exceptional
paying
300+
terribly
disappointed
wife
stayed
nicest
suites
200/night
felt
like
overpaying
best
advice
shop
quality-wise
league
average
marriott
nice
best
western
disappointed
anticipating
stay
hotel
monaco
based
reviews
seen
tripadvisor
definitely
disppointment
decor
room
hotel
envisioned
nice
housekeeping
staff
impressive
extremely
polite
cheery
helpful
desk
bellmen
standard
customer
service
lots
little
things
easily
overlooked
broken
make
mirror
sagging
post
bathroom
jiggly
entrance
handle
room
feel
secure
handle
nearly
falling
door
husband
early
morning
flight
mid-week
asked
called
suggested
ride
cost
double
private
flat-rate
case
knew
cost
bell
staff
insisted
like
taxi
ride
driver
later
explained
bell
staff
kick
referrals
preferred
guests
city
and/or
hotel
hotel
staff
looking
best
interests
years
planned
dining
restaurant
hotel
year
came
dressed
dinner
told
desk
closed
holiday
asked
nearby
response
good
luck
finding
today
good
luck
thanks
help
feature
needed
hotel
business
centre
work
downstairs
service
completely
semi-funcitional
internet
service
out-sourced
ended
spending
money
work
refund
hours
vacation
time
trouble-shooting
internet
company
toll
free
service
line
asked
desk
times
assistance
told
worst
experience
time
asked
desk
assistance
response
included
shrug
majority
staff
attitude
just
simply
care
needed
help
dared
intrude
time
snotty
response
occasions
caught
desk
girls
smirking
thought
turned
talk
frustrating
honesty
wait
check
nice
decor
liked
goldfish
housekeeping
staff
great
hotel
want
dash
door
concerned
taking
greet
pretty
ignored
desk
area
unless
approached
time
street
westin
nothing
smiling
faces
coming
going
hotel
great
location
need
internally
upgrade
advantage
north
downtown
seattle
great
restaurants
nearby
good
prices
rooms
need
updated
literally
thought
sleeping
1970
pillows
sheets
result
nights
sleep
stay
location
staff
friendly
good
location
poor
cleanliness
warwick
hotel
great
location
seattle
close
shopping
pike
place
seattle
centre
really
lets
hotel
cleanliness
linen
torn
curtains
torn
floor
stains
hotel
advertises
having
balcony
reality
disappointment
stayed
hotel
diego
balcony
table
chairs
warwick
balcony
inches
view
rooms
view
space
needle
terrific
does
make
poor
cleanliness
check
staff
pleasant
unpleasant
decided
sample
restaurant
ralph
deli
street
great
snacks
cafe
there
plenty
better
hotels
seattle
slightly
money
warwick
choose
hotel
andra
warwick
good
reviews
warwick
shocks
staff
quite
rude
rooms
fairly
dirty
asked
bandaid
requested
bottle
opener
better
service
austin
powers
decor
familiar
hotel
seattlewhere
sheets
different
colors
hair
okbecause
clean
second
bathroom
friend
cringe
asked
brought
flip
flops
sanitizer
spray
dirty
shag
carpet
stop
wall
crawled
inches
star
shining
worse
great
location
stay
long
needed
place
stay
seattle
prior
catching
early
morning
amtrak
train
portland
looked
train
station
dropping
hertz
hilton
downtown
just
wanted
place
spend
night
called
hotel
seattle
based
location
tourist
near
hilton
access
internet
research
reviews
stay
location
great
virtually
door
high
hotels
half
price
hilton
thought
checked
asked
discount
clerk
response
time
heard
hotel
desk
clerk
knowing
room
used
budget
movie
version
hotel
threadbare
carpets
dingy
curtains
quite
hanging
right
minimal
lighting
strange
hanging
light
middle
room
dingy
bathroom
definitely
dingy
appear
obviously
dirty
luckily
need
particularly
comfortable
little
boucy
people
definitely
gravitated
middle
clock
room
wake
requested
spending
night
want
spend
positive
great
safe
location
quick
taxi
ride
train
station
shower
great
invested
flow
shower
heads
water
pressure
really
high
really
enjoyed
conversation
desk
clerk
morning
mentioned
clerk
previous
night
heard
told
clerk
moron
owner
asked
interview
went
check
reviews
trip
advisor
listed
worst
hotels
seattle
love
type
enthusiastic
employee
worked
night
friend
clerk
mention
nicer
rooms
definitely
want
nice
ones
recommend
room
committing
disappointed
arranging
anticipated
girl
weekend
friend
escape
children
excited
sleeping
night
children
want
enjoy
places
cool
design
stay
boring
run-of-the
hotel
opted
hotel
digs
order
ensure
maximum
uninterrupted
sleep
booked
separate
rooms
arrival
hotel
informed
hotel
mix-up
online
reservation
room
small
queen-sized
supposedly
deluxe
room
normally
suck
accept
just
simple
mistake
time
really
annoyed
irritation
partially
attributed
overall
nonchalant
attitude
uber-cool
reception
person
really
attempt
compensate
slightly
lower
rate
room
fact
checked
reservation
printed
sheet
refused
look
friend
asked
wanting
cross-reference
information
sheet
written
reservation
strange
appeared
mistake
want
admit
quick
blame
online
booking
inference
fault
booking
online
insult
injury
told
shelling
small
fortune
parking
street
parking
reduced
rate
easily
marked
room
dingy
charming
photos
web-site
suggest
couple
rooms
walking
corridors
looked
better
room
anyway
aside
great
location
decently
priced
overall
experience
just
impressive
days
later
received
email
hotel
thanking
staying
hope
enjoyed
stay
responded
email
outlining
frustrations
accomodation
like
time
really
needed
dissatisfaction
hotel
manager
replied
apologetic
email
offered
discount
later
night
stay
redeemed
2008
like
positive
response
negative
experience
planned
return
hotel
husband
romantic
away
so-called
compensatory
offer
acknowledged
multiple
attempts
contact
manager
specific
date
weekend
messages
nothing
return
messages
know
happened
reply
guess
hotel
does
need
business
experience
isolated
case
event
planning
stay
time
soon
seattle
crown
plaza
worth
money
late
hotel
1230pm
gave
away
reservation
king
sized
travel/business
days
booked
hotel
girl
reception
desk
asked
late
blamed
shift
giving
away
room
thing
said
nothing
proceded
offer
breakfast
change
room
morning
rude
make
good
contact
manager
manager
morning
days
people
helpful
pleasant
deal
hotel
accomodations
need
renovations
example
wallpaper
bathroom
peeling
king
bedroom
gave
corner
room
probably
inconvenience
furniture
room
small
dressers
small
tried
safe
room
broken
immediately
called
desk
asked
help
days
later
checked
addressed
good
thing
food
breakfast
buffet
healthy
good
lunch
manager
trying
make
poorly
trained
employee
clam
chowder
salmon
spinach
salad
crab
cakes
really
good
priority
award
floor
member
hilton
honors
priority
award
intercontinental
chain
hilton
properties
chose
night
seattle
hilton
given
gold
hotel
room
checkin
room
32nd
floor
view
quite
impressive
good
experience
ended
32nd
floor
reserved
priority
members
lounge
complimentary
appetizers
evening
room
adjacent
elevator
lounge
dinner
returned
room
9:30
pm/am
lounge
cleaned
hotel
staff
vacuums
going
employees
chattering
making
incessant
noise
cleaning
commercial
office
building
regard
guests
priority
club
floor
management
clue
lounge
cleaned
8-9-
common
sense
finally
posters
indicated
right
elevator
shaft
hear
waited
minutes
elevator
arrive
5:00
taken
clue
earplugs
sleep
check
holiday
time
seattle
delayed
anniversary
trip
wanted
stay
nicer
hotels
room
reminded
holiday
level
hotel
plain
room
extra
pillows
bathroom
ordinary
corian
sink
ordinary
bathroom
room
higher
floor
looking
freeway
loud
reason
earplugs
sleep
asked
switch
rooms
told
probably
stay
stay
nights
staying
hotel
different
area
town
luggage
room
decided
stopped
concierge
asked
good
place
walk
rudely
told
just
walk
area
sure
concierge
doorman
just
sitting
desk
expected
help
decided
night
hotel
come
earlier
happily
said
used
club
points
crowne
rooms
maybe
lousy
experience
opted
leave
room
luxury
hotel
hotel
1000
recommend
staying
staff
routinely
indifferent
point
rude
parking
arrangement
public
garage
hill
corner
remarkably
inconvenient
mobility
issues
parking
hotel
challenging
maneuver
rooms
adequate
maintained
cleaned
particularly
hotel
easily
better
seattle
definitely
good
location
hotel
located
rooms
quite
cozy
comfy
bathroom
fine
said
toilet
flush
really
noisy
likely
wake
half
middle
night
door
adjcent
room
really
gotdisturbed
night
door
antics
quick
phone
reception
soon
sorted
real
grip
attitude
reception
desk
manager
forget
charm
brick
welcoming
terribly
polite
having
just
arrived
seattle
vancouver
shocked
disappointed
welcometo
city
hotel
management
send
guyon
charm
course
maybe
just
somebody
hotel
convenient
town
cheers
designed
business
stayed
nights
executive
seattle
business
rooms
small
expected
boutique
hotel
prepared
size
bathroom
literally
step
stall
shower
close
door
room
obviously
suite
time
door
adjoining
room
blocked
large
hear
word
conversations
neighbors
having
hotel
offers
free
wireless
nice
desk
work
amazing
comfortable
nice
pillows
great
comforter
conditioning
worked
quite
seattle
best
coffee
house
lobby
great
bonus
plus
beat
location
price
complaints
stay
sacrifice
amenities
price
charm
minor
compared
quality
service
received
hotel
prepared
poor
service
called
confirm
late
arrival
answered
phone
plain
hello
instead
announcing
hotel
arrived
11:00
young
counter
moved
hold
door
help
bags
lobby
steps
elevator
checking
moved
help
bags
stairs
literally
stood
desk
watched
struggle
housekeeping
staff
better
room
looked
like
just
neatened
cleaned
room
coffee
washed
carpet
vacuumed
hopefully
owner
hotel
read
review
shape
staff
disappointing
approximately
weeks
husband
repeat
guests
executive
pacific
plaza
hotel
quick
business
trip
just
month
prior
stayed
5-days
father
graduation
great
time
majority
staff
quite
friendly
inviting
price
affordable
rooms
nice
location
amazing
needs
challenge
encountered
reserved
room
asked
nice
reservationists
confirmation
directed
e-mail
forward
fathers
itinerary
traveling
california
assured
occur
experience
great
talking
property
affordability
location
needed
return
business
selected
property
positive
experience
weeks
prior
time
booked
reservation
on-line
party
immediately
receive
confirmation
itinerary
travels
exactly
occurred
called
property
advance
confirm
arrangements
informed
bringing
confirm
acknowledgement
arriving
property
mentioned
returning
just
weeks
previous
visit
acknowledged
assigned
room
entered
quite
impressed
room
located
wing
hotel
hallway
rooms
clustered
hand
written
signs
room
doors
stating
painting
located
floor
previous
room
king
queen
room
small
cramped
view
house
workings
systems
staying
long
issue
time
checked
needed
leave
event
5:00pm
sound
possibly
paint
sprayer
cause
discomfort
returned
hotel
approximately
11:30pm
tired
total
4-days
travel
early
late
events
slept
just
fine
promptly
7:47am
awaken
sounds
staff
yelling
forth
stopped
minutes
began
decided
time
pack
leave
deal
guess
husband
took
walk
continued
prepare
departure
came
tell
went
broken
contacted
garage
attendant
told
level
garage
happens
time
offered
parking
hotel
point
weighing
entire
experience
limited
stay
feeling
quite
disappointed
decided
share
experience
management
check
asked
nice
desk
attendant
speak
manager
regards
experience
stated
desk
supervisor
wish
speak
general
manager
told
comfortable
speaking
comfortable
share
said
went
explain
entire
experience
empathized
added
appeared
apparent
penalized
booking
party
room
assignment
opportunity
raised
upgrade
chose
quite
confident
hotel
occupancy
stated
construction
noise
given
option
bothered
advance
argue
facts
offered
credit
parking
charge
said
credited
room
night
charge
paid
just
insult
injury
point
said
treated
better
parking
garage
management
graciously
offered
vacuum
glass
window
thief
broke
charge
hotel
management
business
past
10-years
believe
understanding
point
view
patronage
unappreciated
hotel
potential
understand
just
recently
changed
ownership/management
july
need
remember
just
need
make
people
feel
special
goes
long
guest
experience
regardless
things
direct
control
weeks
follow-up
hotel
experience
disappointing
yuck
stayed
hotel
nights
earlier
month
stayed
number
renaissance
hotels
states
europe
happy
read
reviews
surprised
mixed
report
felt
worth
risk
trying
remaining
marriott
points
free
stay
category
hotel
shocked
room
straight
earlier
worn
carpet
worn
furniture
ancient
bathroom
satisfactory
mood
different
hotel
thought
tried
internet
sorry
just
sucks
hotel
hours
work
online
transfer
files
slower
fashioned
modem
remember
spent
hour
phone
internet
dept
kept
claiming
people
hotel
sharing
files
overloading
network
make
slightly
better
took
night
files
transfer
hotel
comparison
work
days
earlier
westin
canada
hour
totally
unacceptable
tried
luck
wireless
neighboring
hotel
instead
absolutely
convinced
return
hotel
enjoyed
stay
stayed
hotel
nights
water
temperature
shower
barely
luke
warm
calls
desk
problem
fixed
staff
friendly
restaurant
breakfast
buffet
nice
huge
storm
hardly
noticable
reception
problem
overall
happy
accomodations
stay
happier
reservation
hotels
minute
taxes
paid
room
free
coffee
chocolate
request
wake-up
stayed
similar
boutique-style
hotels
cities
in-room
coffee
bathroom
non-chipping
tiles
bathroom
personally
recommend
hotel
desk
personnel
helpful
reasonably
friendly
bell
personnel
left
waiting
weather
half
hour
said
right
vibrations
short
version
conditioning
hotel
builds
harmonic
modulating
vibration
ducts
coming
basement
room
returns
coming
minute
buildup
release
noise
drove
nuts
figured
nicely
moved
room
realize
problem
probably
hear
rooms
loud
drive
nuts
level
liked
open
windows
hotel
right
continuously
traveled
types
vehicles
quite
loud
windows
open
normal
level
great
marriott
service
pleasant
stay
facility
changes
checked
early
stay
room
dirty
checked
food
substances
carpet
late
night
evening
maid
service
provide
maid
service
stay
week
furnishings
cheap
room
small
simply
worth
price
motel
masquerading
pricier
simply
worth
parking
stinks
husband
booked
room
year
half
wonderful
view
city
lights
unfortunately
gotten
chance
wanted
thrilled
great
deal
priceline
days
looked
forward
nice
time
weekend
check-in
parking
informed
park
hotel
night
told
expensive
places
park
area
total
walking
area
probably
checked
ahead
time
honestly
remember
time
hotel
renting
room
does
free
parking
greatly
reduced
stay
customer
service
woman
checked
friendly
barely
polite
maybe
night
like
offer
website
11th
floor
freeway
view
quite
noisy
pretty
disappointing
requests
ahead
time
king
non-smoking
room
taken
care
double
check
check-in
good
thing
offered
complimentary
chocolate
wakeup
tasty
stay
closer
home
affordable
hotel
does
stiff
parking
time
miss
hotel
vanish
miss
hotel
jewel
hilton
family
crown
long-in-the-tooth
room
carpet
pronounced
grease
stain
temperature
difficult
control
room
pooly
taking
elevators
thrill
ride
half
time
floor
number
display
elevator
work
missed
digit
elevator
rocket
past
floor
open
inner
doors
motion
floor
making
paticularly
worrisome
small
child
interior
elevator
doors
scratched
grafitti
businessman
continental
breakfast
place
twice
making
play
detective
morning
breakfast
held
tiniest
conference
rooms
internet
service
room
off-line
refunds
offered
specifically
parking
garage
horrendous
caution
rent
large
long
vehicle
make
u-turn
required
second
floor
chances
staying
zero
just
need
clean
space
sleep
just
finished
5-night
stay
comfort
suites
downtown
seattle
moved
hotel
road
night
heading
home
surprised
difference
hotel
facility
stayed
quality
inn/suites
past
favorite
quality
inns/suites
comfort
inns/suites
operated
hotel
family
chain
expect
equivalent
similar
quality
standard
especially
hotels
feet
away
despite
quality
inn/suites
downtown
seattle
offers
clean
basic
rooms
maybe
5-10
pricing
somewhat
run-down
facility
bear-cave
feel
small
dark
guess
just
want
simple
basic
place
stay
budget
conscious
hotel
seattle
okay
choice
mediocre
overall
upgrades
definitely
needed
hotel
price
older
hotel
somewhat
check
quick
room
king
small
noisy
good
breakfast
dining
area
grungy
looking
hotel
plus
convenient
space
needle
their
transport
safeco
field
small
shuttle
told
handle
passengers
realizing
hold
crowd
waiting
hotel
shuttle
minute
wait
slow
trip
game
rush
hour
shuttle
make
trips
forth
avoid
construction/refurbishment
completed
stayed
sheraton
seattle
cruise
hotel
perfect
location
walk
downtown
restaurants
shops
hotel
construction
entrance
poorly
marked
hotel
taxi
driver
pull
curb
construction
materials
street
help
luggage
ramp
street
lobby
offered
help
luggage
late
check
breeze
minutes
sets
elevators
depending
floor
directed
wrong
fortunately
caught
error
getting
room
clean
standard
outdated
shades
buff
yellow
gift/sundry
shop
construction
restaurant/bar
just
cordoned
section
lobby
seattle
sheraton
construction
refurbishment
finished
thought
secured
felt
reasonable
rate
hotwire
feel
hotel
worth
price
lemon
going
check
recheck
days
later
asked
avenune
heavey
luggage
days
come
check
desk
refuesed
unbeliable
othere
average
hotelalways
luggage
recheck
days
avenue
innis
kindness
victoria
easy
hand
free
trip
victoria
carrying
heavy
luggage
agency
tried
asked
nunber
avenue
told
disconnet
number
agency
called
unable
desk
gave
busy
line
number
agency
unable
avenue
doew
customer
line
avenune
exclude
internet
customer
unable
receive
important
3since
unable
agent
tried
room
desk
said
telephone
room
working
today
imagine
customer
intenet
overall
hotel
does
provide
service
telephonecommunication
service
room
terrible
service
thinking
customers
emergency
happen
family
howguest
know
news
willl
recommend
ohters
hotel
great
location
laughable
rooms
booked
flights
seattle
package
great
deal
people
nights
airfare
choice
stay
hotel
kind
stinky
refused
elevator
decrepit
smelled
vomit
stairways
smelled
like
room
quite
clean
bare
walked
city
times
location
hotel
superb
belltown
tons
cute
places
drink
right
downtown
plethora
chain
clothing
stores
know
stay
certainly
sufficient
budget
minute
long
weekend
trip
watch
bait-and-switch
room
rates
rooms
acceptable
having
restaurant
attached
hotel
helpful
booked
rooms
hotels
thankfully
printed
email
confirmations
showing
rates
since
initially
doubles
available
reserved
single
queen
rollaway
order
sisters
share
room
arrived
room
queen
beds
cancelled
rollaway
when
checked
management
version
rates
higher
night
room
certainly
understand
days
multiple
coupons
memberships
discounts
misunderstanding
occur
issue
email
printout
took
minutes
convince
fairly
hostile
desk
adjust
final
bill
after
returned
home
checked
visa
addition
room
charges
single
charge
turns
never-seen
never-used
rollaway
having
lengthy
discussion
long-distance
phone
called
visa
disputed
charge
hotel
management
basic
hotel
basic
needs
hotel
perfect
young
travellers
just
need
place
sleep
needs
that
rooms
basic
clean
beds
comfortable
bathrooms
clean
water
small
showers
desk
staff
friendly
helpful
essentially
star
hotel
fair
square
bring
earplugs
walls
paper
constant
noise
street
rooms
just
people
room
moving
awake
night
creates
loud
creaking
thumping
sound
step
take
area
so-so
walking
distance
main
areas
attractions
rides
short
cheap
central
location
want
walking
immediate
area
surrounding
hotel
best
feature
hotel
restaurant
staff
amazingly
friendly
attentive
fast
service
notch
food
great
expect
gourmet
cusine
hotel
callibre
homestyle
american
food
good
oversized
portions
perfect
sharing
stay
hotel
bring
earplugs
average
experience
rooms
sixth
avenue
included
delta
weekend
getaway
package
seattle
centrally
located
hotel
choose
seek
again
property
showing
rooms
cramped
dark
furnishings
uncomfortable
extremely
hard
beds
rickety
wicker
patio
furniture
used
place
conventional
chairs
high
speed
internet
access
provided
port
wired
wall
does
extend
tiny
nearby
desk
making
computers
difficult
pay-as-you-go
terminal
lobby
slow
crippled
worth
money
place
stay
plan
work
room
desk
staff
helpful
needed
refax
documents
breakfast
restaurant
surprisingly
hearty
seek
lived
seattle
breakfast
included
room
property
best
choice
business
vacation
users
good
solution
young
people
looking
inexpensive
rooms
heart
seattle
disappointed
sixth
avenue
nice
place
stay
changes
staff
hotel
nice
tried
helpful
stay
sixth
avenue
recommend
stay
significant
changes
need
assigned
smoking
room
room
told
room
smoking
room
making
reservation
like
marble
slab
pillows
lumpy
spotted/dirty
small
extra
blankets
pillows
room
mistook
bath
towel
hand
towel
towels
small
towels
towels
person
requested
ironing
board
cover
board
dirty
totally
grossed
towel
cover
hotel
continuously
understaffed
hostess
busboy
running
frantically
restaurant
watch
care
guests
maid
service
come
room
late
afternoon
arriving
shampoo
bottle
room
opened
looked
like
shampoo
missing
usually
hotel
problems
just
nice
hotel
okay
amazing
lost
bags
stayed
friend
wedding
high
expectations
going
hotel
impressed
checked
rooms
small
cramped
bathrooms
small
stayed
sheraton
seattle
previous
nights
paid
price
impressed
accommodations
sheraton
better
accommodations
bigger
rooms
bigger
bathrooms
cleaner
upscale
during
checkout
checked
bags
hotel
lunch
came
bags
nobody
able
ended
having
bellboy
basement
bags
ended
finding
locked
random
room
basement
staff
pretty
worthless
bags
lost
poor
service
good
reviews
andra
gets
makes
wonder
stayed
place
wife
spent
nights
honeymoon
seattle
andra
wish
days
trip
anti-climax
having
read
previous
review
hotel
contacted
andra
advance
reserve
room
high
floor
away
elevators
soundproofing
non-existent
what
room
lower
floor
opposite
elevator
willing
away
elevator
floor
package
included
champagne
truffles
arrival
truffles
arrive
final
night
complaints
desk
handed
item
clothing
laundered
came
ruined
overall
andra
great
looking
hotel
marks
poor
service
saving
grace
adjacent
lola
restaurant
serves
great
food
world
class
hotel
chose
hotel
trip
girlfriend
listed
small
luxury
hotels
world
registry
disappointed
hotels
listed
slhw
perfect
hotel
andra
truly
average
fine
average
stayed
nights
rooms
fine
luxurious
bathroom
tiny
problems
works
really
need
seasoned
professional
concierge
knows
doing
just
example
check
early
morning
departure
reasonable
hefty
nights
turning
away
desk
clerk
airport
proceeds
argue
need
easy
airport
downtown
seattle
finally
says
guess
print
mapquest
no-brainer
hoped
location
andra
beat
walking
nearly
sight
seattle
breeze
strain
compare
boutique
hotel
visited
west
coast
amenities
lackluster
weightroom
like
afterthought
staff
astoundingly
incompetent
insincere
know
nothing
property
city
management
hiding
alcove
desk
overall
money
burn
looking
staff
challenge
patience
disappointed
wether
equals
happy
stay
location
family
place
family
wanted
spend
couple
days
seattle
children
ages
seen
ocean
wanted
stay
water
stayed
room
like
room
times
price
hotels
stayed
vacation
tiniest
hidden
costs
annoying
fireplace
looked
nice
control
temperature
room
husband
slipped
night
drink
kids
went
sleep
female
bartender
pleasant
helpful
bellman
people
place
time
unless
wallets
definitely
feel
hotel
worth
money
cosy
lodge
hotel
location
right
water
place
regretably
renovation
work
waterside
facia
meant
comfy
lounge
area
open
sofa
windows
sheeted
stayed
early
november
views
obtained
cosy
modern
area
hotel
lodge
style
modern
trendy
restaurant
despite
opposites
actually
attract
arrival
expense
valet
parking
eased
large
service
hotel
great
especially
concierge
knew
stuff
upgraded
waterfront
room
deal
hotel
room
small
maybe
crammed
furniture
lounge
chairs
small
desk
chair
just
appeared
theme
sitting
cosy
fireplace
fired
easily
controlled
great
just
robe
glass
wine
enjoy
view
sure
ambience
overlooking
park
noisy
main
road
glad
upgraded
bathroom
large
walk-in
stoned-tiled
shower
great
toiletries
fantastic
shower
water
pressure
refresh
dead
room
service
poor
food
arrived
cooked
appetising
additionally
lobby
areas
looking
little
worn
tired
room
viewed
critical
very
enjoyable
main
city
shops
albeit
5cab
ride
ideally
necessary
would
recommend
hotel
want
relaxing
stay
cosy
room
make
hotel
views
beautiful
view-disappointing
service
stayed
edgewater
15th
anniversary
paid
small
fortune
beautiful
waterfront
room
unfortunately
water
water
room
apparently
replacing
plumbing
told
nothing
said
reserved
checked
went
upstairs
shower
change
dinner
water
flush
toilet
inquired
desk
manager
just
said
just
wait
awhile
sure
water
hour
excited
ready
shower
turned
water
brown
goop
awhile
cleared
water
inquired
told
soon
couple
hours
tried
lukewarm
called
desk
assured
finally
hotel
engineer
come
room
turned
water
blast
stood
minutes
agree
explanation
promise
thought
leaving
hotel
time
late
manager
nothing
offer
free
breakfast
coupons
encountered
manager
refunded
night
nothing
really
makes
miserable
stay
supposed
relaxing
romantic
night
away
kids
stressful
miserable
stay
sadly
disappointing
spotty
service
mixed
overhyped
atmosphere
rooms
quaint
conditioning
sleep
high
hard
acheive
considering
knob
broken
suite
smallest
shower
seen
second
took
phoned
clean
room
fitness
center
joke
staff
friendly
completely
ineffective
valet
parking
highlight
just
looking
fine
vacation
overrated
outdated
location
hotel
great
really
told
doing
construction
nearby
called
times
construction
going
street
south
north
towers
construction
started
6:00am
7:00pm
just
thought
break
saturday
started
7:00am
rooms
outdated
nicest
westin
stayed
stayed
hotel
location
price
original
plan
stay
market
guarantee
water
view
canceled
mistake
seriously
spend
extra
money
stay
market
hotel
beautiful
small
westin
able
check
11:00am
happy
early
check
informed
desk
clerk
birthday
upgraded
sent
south
tower
room
really
small
view
building
construction
room
stain
floor
thinking
animal
urine
figure
upgrade
room
looked
like
basic
room
nothing
special
went
spoke
clerk
said
north
tower
water
views
inform
double
beds
fine
clerk
originally
helped
came
loudly
said
problem
upgraded
room
rude
considering
know
asking
second
clerk
apologized
confusion
informed
thought
upgrade
water
view
went
second
room
water
view
view
construction
going
street
room
little
dirty
night
stand
layer
dust
curtains
coming
room
small
stain
floor
thing
dated
room
bedding
hotel
seriously
needs
updated
paid
night
felt
ripped
recommend
spending
night
especially
noise
construction
sites
location
great
tons
restaurant
walking
distance
catch
airport
shuttle
right
outside
hotel
plan
going
seattle
year
time
stay
market
disappointed
booking
expedia
assigned
room
average
view
elevated
floor
requested
specifically
issues
housekeeping
attention
details
hair
arrival
carpet
stains
proper
restocking
towels
soap
coffee
constantly
make
requests
express
annoying
hotel
charmless
cold
return
other
staff
friendly
decent
hotel
aging
major
stayed
westin
2004
budget
issue
acceptable
experienced
second
stay
forced
turn
plan
rest
head
westin
issue
structural
towers
built
1982
interior
rooms
longer
make
viable
option
going
rate
11th
12th
northwest
canada
experienced
strongest
windstorms
2007
acknowledge
writing
review
timing
present
21st
floor
tower
days
guests-including
myself-experienced
long
restless
night
creaking
wood
structure
wind
whistling
poorly
sealed
windows
reviews
hotel
note
point
towers
rooms
amenities
addressed
certain
westin
invest
major
structural
retrofitting
sell
property
avoid
needed
upgrading
westin
workout
room
pool
small
comprised
bike
machines
core
workout
ball
expensive
little
oldy
stayed
night
work
related
trip
nice
view
downtown
seattle
room
expensive
night
room
definitely
need
decoration
refreshment
price
travelling
time
right
1990
especially
bathroom
really
needs
refit
understand
paying
kind
money
really
city
like
new-york
francisco
seattle
march
charged
stay
someplace
rooms
cold
damp
cozy
means
building
windows
make
feel
like
jail
hallways
run-down
cold
motel
feeling
stay
nicer
inn/motel/hotel
street
quinta
better
experience
pleased
travelodge
space
needle
leaves
bitter
cold
feeling
care
coziness
want
save
place
seattle
cold
rainy
long
warm
coziness
quinta
want
stay
experienced
thing
liked
hotel
staff
real
courteous
expected
arrived
checked
immediately
lobby
basic
clean
free
coffee
chocolate
places
open
sitting
packed
luggage
cart
rolled
elevator
sign
stating
maintenance
doors
close
immediately
opened
basically
fast
liable
lose
limb
right
nearly
chopped
upon
entering
hotel
room
noticed
decor
updated
1968
towels
bathroom
stains
pillows
lumpy
literally
suffice
packed
right
checked
noticed
view
dumpsters
back
looking
inexpensive
place
stay
able
spend
night
stay
watertown
street
times
better
worth
price
reservation
problems
thought
contacting
property
directly
guess
long
distance
charge
purpose
dial
kimpton
general
number
desk
make
annual
reservation
thanksgiving
weekend
happen
connected
know
country
victoria
come
said
code
exist
explain
code
postal
codes
different
stayed
times
felt
service
received
bordering
terrible
asked
best
possible
rate
advised
said
book
cheap
tickets
expedia
price
matched
hold
ages
came
saying
pulled
strings
rate
want
feel
like
going
stay
service
wine
hour
safety
property
agent
needs
head
shake
feel
special
love
email
management
horrendous
service
staff
desk
terrible
bordering
rude
convenience
provided
tried
charge
soda
room
vending
machines
hotel
mandatory
parking
service
good
expensive
28/day
given
lower
floor
deal
construction
noise
street
on-ramp
freeway
hotel
convenient
freeway
whatever
adjacent
restaurant
track
waitress
check
out-
lounge
having
breakfast
suggest
higher
price
corner
crowne
plaza
princess
arrived
hour
check-in
waiting
minutes
lobby
check
given
room
shocked
desk
clerk
assigned
room
couple
ahead
thankfully
newlyweds
waiting
line
spoke
clerk
shocked
thing
occurred
chose
personally
check
room
assigning
presumably
felt
human
error
impressed
point
especially
confronted
30/night
parking
given
corner
room
demonstrated
make
bright
fairly
large
airy
night
shoudl
bathroom
tiny
toilet
flush
adjusted
valve
tank
viewed
despite
offering
variety
view
movies
worst
slept
kimpton
perfect
boasted
brochure
hard
cheap
king
mattress
featherbed
non-pillow
mattress
nights
sleep
mitigated
good
black
curtains
needed
augment
sleep
sleep
soundproof
rooms
hotel
potential
wonderful
lived
brochures
noisey
nice
expected
work
seattle
live
whidbey
island
occasionally
spend
weekend
city
spent
fair
time
looking
hotels
listed
trip
advisor
decided
hotel
looked
nice
pretty
disappointed
room
nice
alexis
market
sorrento
stayed
room
wear
tear
broken
door
amour
bathroom
broken
lock
mini
expecting
luxury
linens
price
paying
worst
jack
hammers
construction
just
outside
window
friday
evening
construction
library
noise
subsided
7:30pm
start
weekend
hotel
vintage
park
noise
morning
cement
poured
street
called
desk
moved
room
rooms
available
turned
expensive
noisey
weekend
dont
bother
contrary
belief
booked
rooms
hotel
saturday
night
celebration
best
friends
birthday
staff
snotty
checked
3:00
rooms
asked
facing
ugly
garage
ready
ended
floors
apart
facing
uglyiest
bulidings
paid
time
booking
told
know
make
stay
better
know
parked
hotel
parking
rip-off
people
actually
tried
open
door
sucessful
things
needed
dealt
husband
brought
desk
dinner
reservation
told
send
room
huge
crowd
listening
techno
beat
music
bartender
rude
young
thought
cruise
cocktail
room
site
went
desk
basically
told
brand
clothes
macys
waited
morning
talk
manager
friendly
awhile
missing
imagine
assume
employed
star
hotel
meet
requirement
overly
friendly
better
service
nicer
hotel
just
streets
away
warwick
room
dusty
think
drinking
water
know
cool
classy
status
refuse
bottle
water
room
free
line
spend
fairmont
good
star
trust
avoid
place
bought
thing
early
hotel
darker
stayed
come
walking
city
thing
loud
thumping
music
fills
lobby
want
hear
long
work
hear
desk
staff
rooms
priced
sheraton
westin
dream
beds
want
room
clean
dark
place
dark-
blinds
window
outside
light
finally
offered
hang
black-out
curtains
heard
took
black
metal
crammed
window
black
fabric
safety
pinned
better
blinds
seattle
coffee
maker
touted
restauarant
just
dont
location
ambience
pricey
pleased
services
stayed
nights
attend
wedding
ambience
style
nice
wedding
reception
exactly
bride
wanted
pleased
services
hotel
dark
guess
caters
trendy
crowd
cost
parking
drinks
ridiculous
parking
twice
paid
hawaii
upscale
hotel
careful
promo
code
discounted
rooms
work
beds
comfortable
pillows
note
aware
allow
animals
received
numerous
bites
night
14th
floor
view
north
hotel
housekeeping
discarded
items
discarded
thou
rental
bags
left
agree
reviewer
breakfast
pike
place
market
mcdonalds
westlake
center
watching
pennies
staying
watching
pennies
stay
seattle
choosing
worth
money
echo
concerns
astronomical
expenses
parking
room
service
poor
service
stayed
hotel
couple
friends
expecting
pleasant
stay
swanky
hotel
realize
money
paying
likely
ambiance
rooms
utterly
lacking
character
nightclub
lighting
hallways
creepy
lobby
says
hotel
trendy
aspirations
minor
requests
stay
second
request
silverware
lectured
charged
non-revenue
request
apparently
motto
come
line
right
price
staff
like
bothered
room
bland
unimpressive
nice
television
comfortable
hotel
good
location
nice
expensive
hotels
offer
better
service
like
olympian
street
westin
unless
good
deal
150/nt
worth
money
overpriced
trendy
hotel
clean
provide
expensive
valet
parking
shampoo
conditioner
provided
nice
shampoo
conditioner
hotel
business
center
charged
minute
internet
usage
free
wi-fi
local
phone
service
short
local
phone
calls
racked
charge
piece
hotel
nickel
dime
food
including
breakfast
expensive
positive
nice
plasma
room
beds
comfortable
cool
does
mean
great
service
just
stayed
hotel
seattle
news
dark
lobby
suppose
cool
dark
hallways
suppose
cool
poor
sevice
suppose
cool
room
service
joke
wrong
food
cold
food
housekeeping
3:30
concierge
services
existent
think
candles
lobby
designer
clothes
young
staff
hotel
means
small
husband
particularly
fond
funky/modern
boutique
hotels
size
room
left
disappointed
rooms
clean
decorated
cool
little
space
expecting
square
foot
suite
small
hardly
carpet
walk
bathroom
hands
smallest
seen
lives
maybe
advantage
able
shower
toilet
wash
hands
time
sushi
restaurant
attached
hotel
great
staff
friendly
good
location
close
shopping
pike
place
market
place
stay
reviews
pretty
target
location
hotel
funky
rehabbed
older
property
downtown
seattle
short
walk
places
downtown
good
hike
connect
buses
convention
center
nearby
nearby
you__Ç_éêl
soggy
going
forth
parking
pricey
general
property
website
portrayals
accurate
boutique
hotel
meaning
small
prides
its__Ç
cool
dÄcor
artwork
lobby
cool
80__Ç_é_
dance
music
speaker
brings
smile
everyone__Ç_é_
face
can__Ç_é_
help
boogie
friendly
desk
clerks
waiting
elevator
services
hotel
minimal
don__Ç_é_
expect
offerings
hotels
rate
rooms
pictures
reviewers
accurately
portray
room
overall
good
level
famous
westin
marriott
beds
mattress
room
firm
pillow
don__Ç_é_
luggage
rooms
equipped
rooms
best
single
travelers
closets
small
armoires
drawer
person
socks
underwear
like
check
check
process
easy
making
reservation
clerks
didn__Ç_é_
assigning
king
room
respected
like
plus
desk
clerks
managers
hotels
refuse
honor
reservation
steer
room
queen
beds
ironic
problems
started
little
things
assigned
room
usually
reserved
special
needs
guests
problem
fact
bath
bathroom
large
shower
happened
toilet
sink
allows
easy
wheelchair
access
shower
water
goes
curtain
floor
leaked
room
days
learned
roll
damp
towels
create
shower
towel
sagging
fall
addition
housekeeping
hard
time
remembering
restock
soaps
times
robes
times
small
housekeeping
items
room
staff
politely
took
care
things
address
similar
issues
daily
exhaust
noisy
befitting
hotel
price
star
rating
issues
took
repeated
requests
temperature
control
room
simple
window
unit
unit
noisy
befitting
hotel
price
star
rating
rains
rain
roof
runoff
pounds
metal
housing
result
sound
water
torture
night
wound
opening
window
floor
straddling
windowsill
order
throw
hand
towel
conditioner
noise
killed
worst
thing
wake
service
working
alarm
complicated
didn__Ç_é_
result
missed
meeting
advice
bring
clock
addressed
manager
duty
promised
care
don__Ç_é_
recall
explanation
apology
notification
problem
fixed
took
chances
couple
days
later
worked
busniess
center
business
center
used
children
needed
extensive
myspace
fixes
sessions
desk
desk
clerks
great
quick
conversation
smile
courteous
helpful
hotels
like
staff
reek
attitude
staff
welcoming
approachable
breakfast
attached
restaurant
popular
place
asian
restaurant
offers
breakfast
offerings
basic
breakfast
food
eggs
hash
browns
foo-foo
names
high
prices
breads
pastries
greasy
comparable
items
filling
station
fruit
promised
menu
simply
aged
brown
garnish
left
night
coffee
fantastic
kept
coming
breakfast
times
glutton
punishment
coffee
lover
avoid
place
costs
breakfast
final
verdict
stripping
away
pretty
fa__ade
friendly
service
minimum
service
hotel
compare
motels
block
avenue
avenue
travelodge
half
price
place
simply
place
sleep
worth
standard
89-109
dollars
charged
properties
similar
services
quality
paid
night
considering
downs
place
felt
violated
high
price
stay
better
rate
online
negotiate
reservations
agent
conclusion
stay
safe
clean
place
stay
appreciate
feeling
welcomed
same-gender
couple
know
city
better
places
level
service
comfort
lower
prices
despite
welcoming
staff
cool
dÄcor
upgrade
service
price
and/or
improvement
rooms
consider
again
stayed
march
19-25
room
reading
reviews
felt
good
idea
expect
rooms
definitely
small
crazy
small
bathroom
barely
fits
sink
toilet
room
shower
rooms
diff
configurations
bathrooms
split
basically
room
long
desk
flat
screen
propped
talks
great
customer
service
opposite
experience
late
driving
hours
whistler
night
manager
checked
needed
help
bags
grabbed
luggage
carts
idea
bellperson
point
loaded
cars
elevator
basically
order
luggage
carts
elevator
need
degree
geometry
dead
tired
trying
luggage
carts
elevator
night
manager
just
standing
talking
valet
possibly
bellperson
nobody
offers
help
help
just
struggle
unreal
sure
customer
service
comments
come
definitely
remotely
resembling
customer
service
stay
roosevelt
stayed
departing
whistler
street
cheaper
times
better
stay
stayed
night
august
early
flight
morning
check
easy
cookies
nice
having
printer
lobby
print
boarding
pass
really
convenient
elevators
tower
close
wanted
carry
luggage
tired
bell
hops
asking
thrilled
wanted
borrow
cart
long
walk
room
room
nice
night
inner
hall
quiet
traffic
noise
outside
comfortable
noise
traffic
jets
room
sleep
well
there
mildew
bathroom-cleanliness
fair
shuttle
airport
nice
bottled
water
stay
noise
mildew
stay
room
microwave
refridgerator
price
paid
balconies
shared
separated
metal
gate
furniture
room
damaged
replaced
wireless
internet
rooms
lobby
lounge
high
speed
internet
rooms
plug
hour
certainly
stay
hotel
thing
really
offer
single
chocolate
chip
cookie
check-in
spending
money
wisely
buying
cookies
terrible
driveway/valet
experience
stay
hotels
upper-end
doubletree
major
service/management
problems
dropped
wife
left
return
sea-tac
airport
total
pieces
luggage
zero
help
valet
indide
hotel
trying
checkin
area
single
bellhop
moved
muscle
help
bothered
rotator
cuff
help
getting
bags
hotel
hotel
called
cellphone
told
miserable
service
initially
arrived
hotel
lazy
woman
gated
entrance
hotel
barely
rouse
inside
booth
bothered
question
dropping
bags
miserable
attitude
ones
like
later
parking
outside
attendants
contracted
company
service
awful
clearly
inside
service
outside
wife
normally
mild
retired
major
institution
livid
airport
hotel
food
service
prior
room
service
seattle
cross-country
flights
leave
early
early
airport
early
help
baggage
clear
impression
bellhops
provide
service
hired
hire
muscle
concept
service
alien
property
combination
plus
outside
contracted
driveway
services
lethal
eventually
probably
discussion
returned
property
desk
manager
came
room
apologize
good
service
good
service
received
arrived
hotel
hotel
andra
downtown
seattle
excellent
early
departure
sea-tac
early
stay
recommendations
hotel
location
class
hairy
scary
stayed
location
times
generally
satisfied
visit
discovered
linens
changed
appeared
properly
spotted
stains
pillow
numerous
body
hairs
scattered
sheet
night
manager
took
complaint
listened
passively
apology
informed
bellhop
sent
room
past
prime
stayed
hotel
twice
year
business
trips
stayed
second
time
able
switch
hotels
rooms
need
renovation
dank
smell
furniture
dingy
lobby
atrium
area
nicer
rooms
hotel
used
beautiful
place
stay
fallen
spending
renovations
gold
hilton
member
provide
courtesies
typically
provided
hilton
family
hotels
asked
promised
occassions
provide
desk
good
making
promises
keeping
evening
happy
hour
good
breakfast
buffet
bright
spot
ample
selection
cook
order
omelets
travel
area
frequently
strongly
recommend
hotels
close
proximity
residence
street
marriott
courtyard
door
good
hilton
alternative
doubletree
mile
away
location
close
airport
seatac
area
greatest
restaurants
review
coins
property
tail
remodel
arrival
entire
lobby
torn
apart
desk
relocated
small
desk
door
needless
check
efficient
been
rooms
totally
remodeled
room
quite
punch
list
furniture
completely
assembled
scuffed
wires
protruding
hole
workstation
shower
head
leaky__Çî__he
great
appreciate
layout
workstation
flat
screen
bathroom
shower
water
punch
items
remained
bathroom
night
confusion
desk
room
assignments
gave
guest
room
twice__Çî_inally
desk
came
surprised
overall
comfortable
linens
towels
help
location
near
airport
aircraft
noise
sure
better
properties
area
remodel
finished
sure
stay
better
stay
options
enjoyable
stay
hotel
arrived
took
nearly
minutes
checked
desk
disorganized
understaffed
despite
fact
reserved
room
queen
beds
people
night
given
room
single
king
sized
checked
given
room
guests
returned
desk
different
wait
lobby
minutes
returned
room
basic
nothing
excited
things
thermostat
work
unable
shut
conditioning
checking
called
manager
requested
refund
listening
problems
encoutered
granted
refund
bait
switch
live
distance
away
airport
stayed
airport
hotel
night
earlymorning
flight
called
radisson
room
andto
confirm
free
parking
room
quoted
00for
room
days
parking
thisat
radisson
years
830pm
drivingand
thought
missed
turn
hotel
turnedaround
drove
construction
site
hotel
hadbrought
email
confirmation
pulled
outwhat
happened
hotel
told
location
hadnever
real
radisson
obviously
mistaken
foryears
given
address
finally
found
told
desk
checked
parkingwas
additional
granted
reasonable
rate
airport
parking
room
plus
taxes
pretty
basic
hotel
dark
wasby
asked
park
toldout
hotel
come
backdoor
room
small
clean
sleep
numberbed
noise
airport
went
themorning
shuttle
